content/index.org
#+setupfile: ../.org-templates/level/0.org
#+title: Index
#+OPTIONS: \n:t

* Welcome to my website!
:PROPERTIES:
:CUSTOM_ID: welcome
:ID:       50eae663-cd66-4a0b-a231-3b5d1c23869e
:PUBDATE:  <2022-07-06 Wed 17:58>
:END:

Hi, I am a self-taught *front-end web developer* specializing in *JavaScript* and its ecosystem, including React.
>_ Read more [[./about.org][about]] me.

Let my *new* blog be a place where you'll find anything JavaScript / Linux related.
>_ Take a look at the [[./blog.org][blog]].

Just started looking for a *remote JavaScript / React* position recently. If you know a good company I should apply to, [[./contact.org][hit me up]]! Until I get this job, I am open for freelance projects as well.

Enjoy your stay! 😊
