public/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-07-28 Thu 22:21 -->
<meta charset="utf-8" />
<title>Index</title>
<meta name="author" content="thewebmasterp" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, target-densityDpi=device-dpi, user-scalable=no, maximum-scale=0.8"><meta property="og:title" content="thewebmasterp.com" /><meta property="og:type" content="website" /><meta property="og:url" content="https://thewebmasterp.com/" /><meta property="og:image" content="https://thewebmasterp.com/img/avatar.jpg" />
<link rel="stylesheet" href="./css/style.min.css" />
<link rel="apple-touch-icon" sizes="180x180" href="./img/meta/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="./img/meta/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="./img/meta/favicon-16x16.png">
<link rel="manifest" href="./site.webmanifest">
</head>
<body>
<div id="preamble" class="status">
<div id='mask'> <div class='lds-ellipsis'><div></div><div></div><div></div><div></div></div> </div>
<script>0</script>
<nav id='topnav'>
<a class='homeLink' href='/index.html' title='The index, landing page of this website'>Home</a>
<a class='blogLink' href='/blog.html' title='My articles'>Blog</a>
<a class='aboutLink' href='/about.html' title='About the website and its owner'>About</a>
<div class='sparse'>
<div class='theme-changer'></div>
</div>
</nav>
</div>
<div id="content" class="content">

<div id="outline-container-welcome" class="outline-2">
<h2 id="welcome">Welcome to my website!</h2>
<div class="outline-text-2" id="text-welcome">
<p>
Hi, I am a self-taught <b>front-end web developer</b> specializing in <b>JavaScript</b> and its ecosystem, including React.<br>
&gt;_ Read more <a href="./about.html">about</a> me.<br>
</p>

<p>
Let my <b>new</b> blog be a place where you'll find anything JavaScript / Linux related.<br>
&gt;_ Take a look at the <a href="./blog.html">blog</a>.<br>
</p>

<p>
Just started looking for a <b>remote JavaScript / React</b> position recently. If you know a good company I should apply to, <a href="./contact.html">hit me up</a>! Until I get this job, I am open for freelance projects as well.<br>
</p>

<p>
Enjoy your stay! 😊<br>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<xml>
     <socmedia>
       <entry>
         <label>Github</label>
         <href>https://github.com/thewebmasterp</href>
         <icon>github.svg</icon>
       </entry>
       <entry>
         <label>Instagram</label>
         <href>https://www.instagram.com/webmaster_project</href>
         <icon>instagram.svg</icon>
       </entry>
       <entry>
         <label>Twitter</label>
         <href>https://twitter.com/thewebmasterp</href>
         <icon>twitter.svg</icon>
       </entry>
       <entry>
         <label>Codepen</label>
         <href>https://codepen.io/thewebmasterp</href>
         <icon>codepen.svg</icon>
       </entry>
       <entry>
         <label>Blog RSS Feed</label>
         <href>/blog.xml</href>
         <icon>rss.svg</icon>
       </entry>
     </socmedia>
     <subscribe>
       <cta></cta>
     </subscribe>
     <info>
     </info>
   </xml>
</div>
</body>
</html>
